package DAO;

import java.util.List;

public interface IUserDAO {
    //баланса счета, последних операциях, срок действия
    List<String> showInfo();

    boolean hasUser(String username, String password);
    //банковские переводы

    //оплачивать счета
    //Для Кредитных Счетов также доступна информация по кредитном лимите,
    //текущей задолженности, сумме начисленных процентов, кредитной ставкой.

    //Для Депозитных счетов - сумма депозита, ставка, история пополнения.

    //Пользователь может подать запрос на открытие кредитного счета, если
    //таковой отсутствует.
}
